import React from 'react';

function AboutUs() {
  return (
    <section
      id="about-us"
      style={{
        padding: '20px',
        maxWidth: '800px',
        margin: '0 auto',
        textAlign: 'right',
        lineHeight: '1.8',
        direction: 'rtl'
      }}
    >
      <h2>למה דווקא אנחנו?</h2>

      <p>כי אצלנו הטיול נבנה סביבכם – ולא אתם סביב הטיול.</p>

      <p>
        אנחנו מציעים ליווי אישי ובניית מסלולים מותאמים אישית לפי תחומי העניין,
        הקצב וההעדפות שלכם – כולל תמיכה מלאה מרגע הרעיון ועד שתחזרו לארץ.
        לאחר שיחת התאמה, נבנה לכם את הטיול המושלם בדיוק בשבילכם, תקבלו תכנית מפורטת במסמך מסודר ובו יפורט כל הטיול עד לרזולוציה הקטנה ביותר.
      </p>

      <p>
        אבל מה שבאמת מייחד אותנו – הוא הידע, ההיכרות והרגישות לצרכים של
        שומרי תורה ומצוות.
      </p>

      <p>אנחנו מתמחים בהתאמת טיולים הלכתיים לחו"ל:</p>
<ul style={{ paddingRight: '50px', listStyleType: 'none' }}>
  <li><span style={{ color: '#1a55a4' }}>✅</span> מסעדות ומכולות עם כשרות מהודרת.</li>
  <li><span style={{ color: '#1a55a4' }}>✅</span> בתי כנסת, מניינים קבועים ומרכזים יהודיים בכל יעד.</li>
  <li><span style={{ color: '#1a55a4' }}>✅</span> אפשרות לינה בשכונות יהודיות.</li>
  <li><span style={{ color: '#1a55a4' }}>✅</span> קברי צדיקים ואתרים רוחניים.</li>
  <li><span style={{ color: '#1a55a4' }}>✅</span> תכנון מוקפד לפי זמני שבת, תפילה וכשרות.</li>
</ul>



      <p>
        אנחנו דואגים גם להדרכה פרטית עם מדריכים דוברי עברית, נהגים אמינים, ועזרה זמינה לאורך כל הטיול.
      </p>
      <br />
      <p style={{ fontWeight: 'bold' }}>
  מרגישים שהחו"ל רחוק מדי או מסובך מדי? תנו לנו לפשט לכם את הדרך –
  אתם רק עושים את השיחה הראשונה. אנחנו נדאג לכל השאר.
</p>

    </section>
  );
}

export default AboutUs;
